c5/src/Catalogs/PaymentOptions/PaymentOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PaymentOptions</name>
  <attributes>
    <name>Due</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Begin</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Edge</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/PaymentOptions/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	StandardButtons.Arrange ( ThisObject );
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	sortPeriods ( CurrentObject );
	
EndProcedure

&AtServer
Procedure sortPeriods ( CurrentObject )
	
	table = CurrentObject.Discounts;
	table.Sort ( "Edge" );
	i = table.Count () - 1;
	while ( i > 0 ) do
		row = table [ i ];
		row.Begin = 1 + table [ i - 1 ].Edge;
		i = i - 1;
	enddo; 
	if ( i > 0 ) then
		table [ 0 ].Begin = 0;
	endif; 
	
EndProcedure
